isValidNonZeroIEEEDouble(System.Byte!System.Runtime.CompilerServices.IsConst*)
\details
Checks if 8 bytes buffer represents a valid non-zero IEEE double value.
(In this format doubles are stored in .dwg files.)